Autodesk.Revit.DB.DocumentPreviewSettings.IsViewIdValidForPreview(Autodesk.Revit.DB.ElementId)
Identifies if the view id is valid as a preview view id.
Remarks:
Only graphical views (3d or 2d) are valid for use as a preview view.  Other
views (such as view templates) will not pass this method.  InvalidElementId
is accepted by this method as this id means that no special view is set for the
preview.
viewId:
The view id.
Returns:
True if the view id is valid for preview, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.DocumentPreviewSettings.PreviewViewId
The view id that will be used to generate the preview.
Remarks:
This view will always be saved as the preview view for the document unless it is overridden
by the value used in SaveOptions or SaveAsOptions.
InvalidElementId signals that there is no permanent preview view for the document.
Where possible the document's active view will be used to generate the preview upon save;
where there is no active view the document will not include a preview.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The view id is not valid to use as a preview view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012